#### Terraform Plan (dev) 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.assume_eks-worker_role: Reading...
data.aws_vpc.conquer-vpc: Reading...
data.aws_iam_policy_document.assume_eks_role: Reading...
data.aws_iam_policy_document.assume_eks-worker_role: Read complete after 0s [id=2851119427]
data.aws_iam_policy_document.assume_eks_role: Read complete after 0s [id=3552664922]
aws_iam_role.eks_worker_role: Refreshing state... [id=dev-conquer-eks-worker-role]
aws_iam_role.eks_role: Refreshing state... [id=dev-conquer-eks-role]
data.aws_caller_identity.current: Read complete after 0s [id=014630368052]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=dev-conquer-eks-worker-role-20231103054542877500000003]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=dev-conquer-eks-worker-role-20231103054542813400000002]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=dev-conquer-eks-worker-role-20231103054542771600000001]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=dev-conquer-eks-role-20231103054542976400000005]
data.aws_vpc.conquer-vpc: Read complete after 1s [id=vpc-080a377054fdb71a7]
aws_subnet.eks_subnets_public["eu-north-1a"]: Refreshing state... [id=subnet-02a05aed2b842b7a1]
aws_subnet.eks_subnets_public["eu-north-1b"]: Refreshing state... [id=subnet-0ef7a85d17d481c65]
aws_subnet.eks_subnets_private["eu-north-1b"]: Refreshing state... [id=subnet-07ffb1a27ae73de4f]
aws_subnet.eks_subnets_private["eu-north-1a"]: Refreshing state... [id=subnet-09bcb4615cab992bf]
aws_eks_cluster.eks: Refreshing state... [id=dev-conquer-cluster]
data.tls_certificate.eks: Reading...
aws_eks_node_group.node-group["eu-north-1b"]: Refreshing state... [id=dev-conquer-cluster:dev-conquer-node-group-1]
data.tls_certificate.eks: Read complete after 0s [id=5007ea61dfb4fcd4db18c0c232d56bef3b07d3dc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.vpc_eip["eu-north-1a"] will be created
  + resource "aws_eip" "vpc_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "dev-conquer-eip-eu-north-1a"
        }
      + tags_all             = {
          + "Name"    = "dev-conquer-eip-eu-north-1a"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.vpc_eip["eu-north-1b"] will be created
  + resource "aws_eip" "vpc_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "dev-conquer-eip-eu-north-1b"
        }
      + tags_all             = {
          + "Name"    = "dev-conquer-eip-eu-north-1b"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc                  = (known after apply)
    }

  # aws_eks_addon.aws-ebs-csi-driver will be created
  + resource "aws_eks_addon" "aws-ebs-csi-driver" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "dev-conquer-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "PRESERVE"
      + service_account_role_arn    = (known after apply)
      + tags_all                    = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

  # aws_eks_addon.example will be created
  + resource "aws_eks_addon" "example" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "dev-conquer-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "PRESERVE"
      + tags_all                    = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

  # aws_eks_node_group.node-group["eu-north-1a"] will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "dev-conquer-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "dev-conquer-node-group-0"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::014630368052:role/dev-conquer-eks-worker-role"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-09bcb4615cab992bf",
        ]
      + tags_all               = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_iam_openid_connect_provider.eks-idp will be created
  + resource "aws_iam_openid_connect_provider" "eks-idp" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + thumbprint_list = [
          + "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ]
      + url             = "https://oidc.eks.eu-north-1.amazonaws.com/id/77399B99DE012E754D2267B9BDDEED73"
    }

  # aws_iam_role.AmazonEKS_EBS_CSI_DriverRole will be created
  + resource "aws_iam_role" "AmazonEKS_EBS_CSI_DriverRole" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "oidc.eks.eu-north-1.amazonaws.com/id/77399B99DE012E754D2267B9BDDEED73:aud" = "sts.amazonaws.com"
                              + "oidc.eks.eu-north-1.amazonaws.com/id/77399B99DE012E754D2267B9BDDEED73:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::014630368052:oidc-provider/oidc.eks.eu-north-1.amazonaws.com/id/77399B99DE012E754D2267B9BDDEED73"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "AmazonEKS_EBS_CSI_DriverRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.AmazonEBSCSIDriverPolicy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEBSCSIDriverPolicy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "AmazonEKS_EBS_CSI_DriverRole"
    }

  # aws_iam_role_policy_attachment.AmazonEC2RoleforSSM will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEC2RoleforSSM" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2RoleforSSM"
      + role       = "dev-conquer-eks-worker-role"
    }

  # aws_nat_gateway.nat_gw["eu-north-1a"] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-02a05aed2b842b7a1"
      + tags                               = {
          + "Name" = "dev-conquer-nat-gw-public-subnet-eu-north-1a"
        }
      + tags_all                           = {
          + "Name"    = "dev-conquer-nat-gw-public-subnet-eu-north-1a"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

  # aws_nat_gateway.nat_gw["eu-north-1b"] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0ef7a85d17d481c65"
      + tags                               = {
          + "Name" = "dev-conquer-nat-gw-public-subnet-eu-north-1b"
        }
      + tags_all                           = {
          + "Name"    = "dev-conquer-nat-gw-public-subnet-eu-north-1b"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

  # aws_route.nat_access["eu-north-1a"] will be created
  + resource "aws_route" "nat_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.nat_access["eu-north-1b"] will be created
  + resource "aws_route" "nat_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private_subnet_rt["eu-north-1a"] will be created
  + resource "aws_route_table" "private_subnet_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dev-conquer-nat-eu-north-1a-rt"
        }
      + tags_all         = {
          + "Name"    = "dev-conquer-nat-eu-north-1a-rt"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id           = "vpc-080a377054fdb71a7"
    }

  # aws_route_table.private_subnet_rt["eu-north-1b"] will be created
  + resource "aws_route_table" "private_subnet_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dev-conquer-nat-eu-north-1b-rt"
        }
      + tags_all         = {
          + "Name"    = "dev-conquer-nat-eu-north-1b-rt"
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + vpc_id           = "vpc-080a377054fdb71a7"
    }

  # aws_route_table_association.private_subnet_rt_association["eu-north-1a"] will be created
  + resource "aws_route_table_association" "private_subnet_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-09bcb4615cab992bf"
    }

  # aws_route_table_association.private_subnet_rt_association["eu-north-1b"] will be created
  + resource "aws_route_table_association" "private_subnet_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-07ffb1a27ae73de4f"
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + endpoint                              = "https://77399B99DE012E754D2267B9BDDEED73.yl4.eu-north-1.eks.amazonaws.com"
  + kubeconfig-certificate-authority-data = (sensitive value)
  + oidc-issuer                           = [
      + {
          + oidc = [
              + {
                  + issuer = "https://oidc.eks.eu-north-1.amazonaws.com/id/77399B99DE012E754D2267B9BDDEED73"
                },
            ]
        },
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```

</details>

*Pusher: @carlosgit2016, Action: `pull_request`, Working Directory: ``, Workflow: `create-ephemeral-resources`*